Tekla.Structures.Model.RebarSpacing.ExactSpacing.Validation
Defines values used in validation of exact spacing elements.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Validation.VALID
The elements are valid.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Validation.EMPTY
There are no elements.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Validation.ZERO_ELEMENTS
Contains elements with zero number or distance.

Tekla.Structures.Model.RebarSpacing.ExactSpacing.Validation.NEGATIVE_ELEMENTS
Contains elements with negative number or distance.